Fix README formatting
